rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_threadx.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_threadx.c
 * @author  MCD Application Team
 * @brief   ThreadX applicative file
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_threadx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "app_camera_diagnostics.h"
#include "app_camera_config.h"
#include "app_camera_buffers.h"
#include "app_camera_capture.h"
#include "app_camera_platform.h"
#include "app_baseline_runtime.h"
#include "app_ai_config.h"
#include "app_ai_state.h"
#include "app_ai_stage_tip_focus.h"
#include "app_inference_runtime.h"
#include "app_image_cleanup.h"
#include "app_storage.h"
#include "app_threadx_config.h"
#include "app_memory_budget.h"
#include "app_filex.h"
#include "app_ai.h"
#include "ds3231_clock.h"
#include "main.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "debug_console.h"
#include "debug_led.h"
#include "threadx_utils.h"
#include "cmw_camera.h"
#include "cmw_imx335.h"
#include "cmw_utils.h"
#include "imx335.h"
#include "imx335_reg.h"
#include "ina219_power.h"
#include "npu_cache.h"
#include "sd_debug_log_service.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define CAMERA_STARTUP_MEDIA_READY_TIMEOUT_MS 90000U

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */

/* Dedicated ThreadX object and stack for camera connection diagnostics. */
static TX_THREAD camera_init_thread;
static ULONG camera_init_thread_stack[CAMERA_INIT_THREAD_STACK_SIZE_BYTES
		/ sizeof(ULONG)];
static bool camera_init_thread_created = false;
static TX_THREAD camera_isp_thread;
static ULONG camera_isp_thread_stack[CAMERA_ISP_THREAD_STACK_SIZE_BYTES
		/ sizeof(ULONG)];
static bool camera_isp_thread_created = false;
static TX_THREAD camera_heartbeat_thread;
static ULONG camera_heartbeat_thread_stack[CAMERA_HEARTBEAT_THREAD_STACK_SIZE_BYTES
		/ sizeof(ULONG)];
static bool camera_heartbeat_thread_created = false;
static TX_MUTEX camera_capture_cmw_mutex;
static bool camera_capture_cmw_mutex_created = false;
CMW_IMX335_t camera_sensor;
bool camera_cmw_initialized = false;
/* The live product contract is CMW/ISP MONO_Y8.  The platform probe may set
 * this again after sensor initialization, but the pre-probe default must not
 * accidentally arm the raw diagnostic pipe. */
bool camera_capture_use_cmw_pipeline = true;
static bool camera_capture_sync_created = false;
bool camera_stream_started = false;
volatile bool camera_capture_failed = false;
volatile uint32_t camera_capture_error_code = 0U;
volatile uint32_t camera_capture_byte_count = 0U;
volatile bool camera_capture_sof_seen = false;
volatile bool camera_capture_eof_seen = false;
volatile bool camera_capture_frame_done = false;
volatile bool camera_capture_snapshot_armed = false;
volatile uint32_t camera_capture_frame_event_count = 0U;
/* DCMIPP callbacks run in interrupt context.  This monotonically increasing
 * event count is the only completion notification they publish; the capture
 * thread consumes it without calling ThreadX from the ISR. */
volatile uint32_t camera_capture_done_event_count = 0U;
volatile uint32_t camera_capture_line_error_count = 0U;
volatile uint32_t camera_capture_line_error_mask = 0U;
volatile uint32_t camera_capture_csi_linebyte_event_count = 0U;
volatile bool camera_capture_csi_linebyte_event_logged = false;
volatile uint32_t camera_capture_vsync_event_count = 0U;
volatile uint32_t camera_capture_isp_run_count = 0U;
volatile bool camera_capture_isp_loop_paused = false;
/* Count raw IRQ entry points so we can tell whether the interrupt chain is
 * alive even when the higher-level callbacks stay silent. */
volatile uint32_t camera_capture_csi_irq_count = 0U;
volatile uint32_t camera_capture_dcmipp_irq_count = 0U;
volatile uint32_t camera_capture_reported_byte_count = 0U;
volatile uint32_t camera_capture_counter_status = (uint32_t) HAL_ERROR;

/* Reuse the CubeMX-generated camera control I2C instance from main.c. */
extern DCMIPP_HandleTypeDef hdcmipp;
extern I2C_HandleTypeDef hi2c2;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */

static VOID CameraHeartbeatThread_Entry(ULONG thread_input);
static VOID AppThreadX_StackErrorHandler(TX_THREAD *thread_ptr);

/**
 * @brief ThreadX entry point used to run camera bring-up diagnostics.
 * @param thread_input Unused ThreadX input value.
 */
static VOID CameraInitThread_Entry(ULONG thread_input);
static VOID CameraIspThread_Entry(ULONG thread_input);

/**
 * @brief ThreadX app initialization hook.
 * @param memory_ptr ThreadX memory pool pointer.
 * @retval TX_SUCCESS on success.
 */
UINT App_ThreadX_Init(VOID *memory_ptr) {
	UINT ret = TX_SUCCESS;

	(void) memory_ptr;

	/* Defer thread creation until App_ThreadX_Start() so startup ordering is explicit. */
	DebugConsole_Printf(
			"[CAMERA][THREAD] ThreadX app init complete. Waiting to start camera thread...\r\n");
	return ret;
}

/**
 * @brief ThreadX startup hook that creates the camera and runtime threads.
 * @retval TX_SUCCESS on success.
 */
UINT App_ThreadX_Start(void) {
	/* Keep this function idempotent to protect against accidental double-start. */
	/* Keep the visible LED off until the heartbeat thread takes ownership so a
	 * solid red LED means fault handling, not normal startup state. */
	BSP_LED_Off(LED_RED);
	BSP_LED_Off(LED_BLUE);
	BSP_LED_Off(LED_GREEN);
	(void) AppImageCleanup_SetBootTick(tx_time_get());
	/* ThreadX is running here, so the INA219 worker can safely create its
	 * semaphore/thread objects and begin periodic voltage sampling. */
	if (!INA219_StartMonitoringThread()) {
		DebugConsole_Printf(
			"[INA219] Monitoring thread start failed after ThreadX startup.\r\n");
	}
	if (camera_init_thread_created && camera_isp_thread_created
			&& camera_heartbeat_thread_created) {
		DebugConsole_Printf(
				"[CAMERA][THREAD] Start skipped: camera threads already created.\r\n");
		return TX_SUCCESS;
	}

	if (!camera_capture_sync_created) {
		const UINT mutex_status = tx_mutex_create(&camera_capture_cmw_mutex,
				"camera_capture_cmw", TX_INHERIT);
		if (mutex_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[CAMERA][THREAD] Failed to create camera middleware mutex, status=%lu\r\n",
					(unsigned long) mutex_status);
			return mutex_status;
		}
		camera_capture_cmw_mutex_created = true;

		camera_capture_sync_created = true;
	}

	{
		const UINT stack_notify_status =
				tx_thread_stack_error_notify(AppThreadX_StackErrorHandler);
		if (stack_notify_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[CAMERA][THREAD] Failed to register stack error callback, status=%lu\r\n",
					(unsigned long) stack_notify_status);
		}
	}

	{
		const UINT storage_init_status = AppStorage_Init();
		if (storage_init_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[CAMERA][THREAD] Failed to create storage-ready event flags.\r\n");
			return storage_init_status;
		}
	}

	{
		const UINT runtime_init_status = AppInferenceRuntime_Init();
		if (runtime_init_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[AI] Failed to initialize inference runtime, status=%lu\r\n",
					(unsigned long) runtime_init_status);
			return runtime_init_status;
		}
	}

	{
		const UINT runtime_start_status = AppInferenceRuntime_Start();
		if (runtime_start_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[AI] Failed to start inference runtime, status=%lu\r\n",
					(unsigned long) runtime_start_status);
			return runtime_start_status;
		}
	}

	{
		/* The learned AI path shares the calibration profile with the optional
		 * classical comparator. Select it even when the baseline worker is
		 * disabled, otherwise the mapper silently falls back to board_celsius_v1
		 * and barometer results are rejected as implausible temperatures. */
		AppBaselineRuntime_SetCalibrationProfileByName(
			APP_BASELINE_CALIBRATION_PROFILE_NAME);

