rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_threadx.c
		/* Print the resolved profile after lookup so a fallback is visible in
		 * the boot log before any baseline inference begins. */
		{
			const AppBaselineRuntime_CalibrationProfile_t *active_profile =
				AppBaselineRuntime_GetCalibrationProfile();
			DebugConsole_Printf(
				"[GAUGE] Active profile: %s\r\n",
				(active_profile != NULL) &&
				(active_profile->profile_name != NULL) ?
				active_profile->profile_name : "unknown");
		}

	}

	#if APP_BASELINE_ENABLE_THREAD
	{
		const UINT baseline_runtime_status = AppBaselineRuntime_Start();
		if (baseline_runtime_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[BASELINE] Failed to start baseline runtime, status=%lu\r\n",
					(unsigned long) baseline_runtime_status);
			return baseline_runtime_status;
		}
	}
	#endif

	if (!camera_isp_thread_created) {
		const UINT isp_create_status = tx_thread_create(&camera_isp_thread,
				"camera_isp", CameraIspThread_Entry, 0U,
				camera_isp_thread_stack, sizeof(camera_isp_thread_stack),
				CAMERA_ISP_THREAD_PRIORITY, CAMERA_ISP_THREAD_PRIORITY,
				TX_NO_TIME_SLICE, TX_AUTO_START);

		if (isp_create_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[CAMERA][THREAD] Failed to create camera ISP thread, status=%lu\r\n",
					(unsigned long) isp_create_status);
			return isp_create_status;
		}

		camera_isp_thread_created = true;
		DebugConsole_Printf(
				"[CAMERA][THREAD] Camera ISP thread created and started.\r\n");
	}

	if (!camera_heartbeat_thread_created) {
		const UINT heartbeat_create_status = tx_thread_create(
				&camera_heartbeat_thread, "camera_heartbeat",
				CameraHeartbeatThread_Entry, 0U,
				camera_heartbeat_thread_stack,
				sizeof(camera_heartbeat_thread_stack),
				CAMERA_HEARTBEAT_THREAD_PRIORITY,
				CAMERA_HEARTBEAT_THREAD_PRIORITY,
				TX_NO_TIME_SLICE, TX_AUTO_START);

		if (heartbeat_create_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[CAMERA][THREAD] Failed to create heartbeat thread, status=%lu\r\n",
					(unsigned long) heartbeat_create_status);
			return heartbeat_create_status;
		}

		camera_heartbeat_thread_created = true;
		DebugConsole_Printf(
				"[CAMERA][THREAD] Heartbeat thread created and started.\r\n");
	}

	if (!camera_init_thread_created) {
		/* Create a dedicated thread so camera probing is isolated from other startup work. */
		const UINT create_status = tx_thread_create(&camera_init_thread,
				"camera_init", CameraInitThread_Entry, 0U,
				camera_init_thread_stack, sizeof(camera_init_thread_stack),
				CAMERA_INIT_THREAD_PRIORITY, CAMERA_INIT_THREAD_PRIORITY,
				TX_NO_TIME_SLICE, TX_AUTO_START);

		if (create_status != TX_SUCCESS) {
			DebugConsole_Printf(
					"[CAMERA][THREAD] Failed to create camera init thread, status=%lu\r\n",
					(unsigned long) create_status);
			return create_status;
		}

		camera_init_thread_created = true;
		DebugConsole_Printf(
				"[CAMERA][THREAD] Camera init thread created and started.\r\n");
	}

	return TX_SUCCESS;
}

/**
 * @brief ThreadX stack overflow/underflow callback.
 * @param thread_ptr Thread that tripped stack checking.
 */
static VOID AppThreadX_StackErrorHandler(TX_THREAD *thread_ptr) {
	const CHAR *thread_name = "unknown";

	if ((thread_ptr != TX_NULL) && (thread_ptr->tx_thread_name != TX_NULL)) {
		thread_name = thread_ptr->tx_thread_name;
	}

	DebugConsole_Printf(
			"[FAULT] ThreadX stack error: thread=%s stack_start=%p stack_end=%p stack_ptr=%p\r\n",
			thread_name,
			(thread_ptr != TX_NULL) ? thread_ptr->tx_thread_stack_start : TX_NULL,
			(thread_ptr != TX_NULL) ? thread_ptr->tx_thread_stack_end : TX_NULL,
			(thread_ptr != TX_NULL) ? thread_ptr->tx_thread_stack_ptr : TX_NULL);
	BSP_LED_On(LED_RED);
	while (1) {
		__NOP();
	}
}

/**
 * @brief Notify the storage module that FileX media is ready.
 */
void App_ThreadX_NotifyStorageReady(void) {
	AppStorage_NotifyMediaReady();
}

/**
 * @brief Lock the shared camera middleware so only one thread touches CMW/ISP.
 * @param timeout_ticks Maximum time to wait for the mutex.
 * @retval true when the caller owns the camera middleware lock.
 */
bool App_ThreadX_LockCameraMiddleware(ULONG timeout_ticks) {
	if (!camera_capture_cmw_mutex_created) {
		return false;
	}

	return (tx_mutex_get(&camera_capture_cmw_mutex, timeout_ticks) == TX_SUCCESS);
}

/**
 * @brief Stop and power down the camera stack before a low-power interval.
 * @retval true when CMW, DCMIPP, CSI, and the IMX335 were safely stopped.
 * @sideeffects Pauses the camera ISP worker, deinitializes CMW, and drives the
 *              camera module power pins to their off state.
 *
 * Keeping the transaction under the existing middleware mutex ensures that no
 * ISP service call can race HAL_DCMIPP_DeInit() or the sensor power transition.
 */
static bool CameraThread_StopCameraStack(void) {
	bool stop_ok = false;
	int32_t cmw_status = CMW_ERROR_NONE;

	/* The ISP worker must not touch CMW while the camera clocks and pipes are
	 * being torn down.  This is deliberately thread-context code, never ISR code. */
	camera_capture_isp_loop_paused = true;
	if (!App_ThreadX_LockCameraMiddleware(
			CameraPlatform_MillisecondsToTicks(
					CAMERA_MIDDLEWARE_LOCK_TIMEOUT_MS))) {
		DebugConsole_Printf(
				"[CAMERA][POWER] Could not lock middleware for camera stop.\r\n");
		camera_capture_isp_loop_paused = false;
		return false;
	}

	DebugConsole_Printf(
			"[CAMERA][POWER] Stopping camera stack before low-power interval.\r\n");

	/* CaptureSingleFrame normally stops the sensor before handing the stopped
	 * buffer to AI.  Keep this guard for recovery paths and future callers. */
	if (camera_stream_started && !CameraPlatform_StopImx335Stream()) {
		DebugConsole_Printf(
				"[CAMERA][POWER] Sensor stream did not enter standby; aborting stop.\r\n");
		goto stop_unlock;
	}

	/* CMW_CAMERA_DeInit() stops active pipes, resets DCMIPP/CSI, deinitializes
	 * the sensor driver, and invokes ST's camera power-down sequence. */
	cmw_status = CMW_CAMERA_DeInit();
	if (cmw_status != CMW_ERROR_NONE) {
		DebugConsole_Printf(
				"[CAMERA][POWER] CMW_CAMERA_DeInit() failed, status=%ld.\r\n",
				(long) cmw_status);
		goto stop_unlock;
	}

