rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_threadx.c
	camera_cmw_initialized = false;
	camera_stream_started = false;

	/* Make the module-level power transition explicit even though the CMW
	 * deinit path also powers it down.  The active-high EN_MODULE and active-
	 * low NRST_CAM polarity is defined by the MB1854 camera board. */
	CameraPlatform_CmwShutdownPin(0);
	CameraPlatform_CmwEnablePin(0);
	DelayMilliseconds_ThreadX(BCAMS_IMX_POWER_OFF_DELAY_MS);
	DebugConsole_Printf(
			"[CAMERA][POWER] Camera module powered off; camera stack stopped.\r\n");
	stop_ok = true;

	/* The camera remains powered off until the Stop-mode proof has returned. */
stop_unlock:
	App_ThreadX_UnlockCameraMiddleware();
	camera_capture_isp_loop_paused = false;
	return stop_ok;
}

/**
 * @brief Probe and start the camera stack after a power or clock transition.
 * @retval true when the IMX335 and CMW pipeline are ready for capture.
 * @sideeffects Pauses the camera ISP worker, enables and resets the camera
 *              module through the platform probe, and locks sensor exposure.
 */
static bool CameraThread_StartCameraStack(void) {
	bool start_ok = false;

	camera_capture_isp_loop_paused = true;
	if (!App_ThreadX_LockCameraMiddleware(
			CameraPlatform_MillisecondsToTicks(
					CAMERA_MIDDLEWARE_LOCK_TIMEOUT_MS))) {
		DebugConsole_Printf(
				"[CAMERA][POWER] Could not lock middleware for camera start.\r\n");
		camera_capture_isp_loop_paused = false;
		return false;
	}

	/* Probe performs the same module enable/reset and CMW initialization used
	 * during initial boot, which is required after Stop mode clock loss. */
	if (CameraPlatform_ProbeBCamsImx() != TX_SUCCESS) {
		DebugConsole_Printf(
				"[CAMERA][POWER] Camera probe failed after low-power interval.\r\n");
		goto start_unlock;
	}
	if (!CameraPlatform_DisableImx335AutoExposure()) {
		DebugConsole_Printf(
				"[CAMERA][POWER] Warning: failed to lock IMX335 exposure after start.\r\n");
	}

	start_ok = true;
	DebugConsole_Printf(
			"[CAMERA][POWER] Camera stack ready after low-power interval.\r\n");

start_unlock:
	App_ThreadX_UnlockCameraMiddleware();
	camera_capture_isp_loop_paused = false;
	return start_ok;
}

/* Stage 2 uses LPTIM1 as its sole low-power wake source.  The DS3231 remains
 * the application time source; its RTC-like name does not imply that the MCU
 * RTC is involved in the Stop proof. */
static volatile bool camera_stop_wakeup_fired = false;
static bool camera_stop_lptim_armed = false;
/* The NPU hardware is initialized once for the application, but it is idle
 * during the long Stop interval. Keep the model SRAM powered for now so the
 * first experiment changes only cache/peripheral clocks and is reversible
 * without rebuilding the relocatable network state. */
static bool camera_stop_npu_suspended = false;
/* xSPI2 contains model weights and is never accessed while the camera/AI
 * workers are inside the one-minute Stop interval. */
static bool camera_stop_xspi2_suspended = false;

/* LPTIM1 is clocked from the 32.768 kHz LSE crystal and uses the N6 internal
 * EXTI line 52 route.  A /32 prescaler gives 1,024 Hz, so a one-minute sleep
 * interval fits in the 16-bit LPTIM autoreload register. */
#define CAMERA_STOP_LPTIM_EXTI_LINE (EXTI_IMR2_IM52)
#define CAMERA_STOP_LPTIM_TICK_HZ   (1024UL)

/**
 * @brief Wait for an LPTIM status flag with a bounded CPU-side timeout.
 * @param flag LPTIM status flag to test.
 * @retval true when the flag was observed before timeout.
 * @sideeffects Reads the LPTIM status register while the peripheral clock is
 *              enabled; does not sleep or perform any blocking RTOS call.
 */
static bool CameraThread_LptimWaitForFlag(uint32_t flag) {
	uint32_t guard = 0U;

	while ((LPTIM1->ISR & flag) == 0U) {
		if (++guard >= 1000000U) {
			return false;
		}
	}

	return true;
}

/**
 * @brief Arm LPTIM1 as an independent Stop-mode wake source.
 * @param duration_ms Requested proof interval in milliseconds.
 * @retval true when the LSE-backed one-shot-equivalent counter is running.
 * @sideeffects Enables LPTIM1 and its low-power clock, configures the LSE
 *              kernel clock, and enables the LPTIM1 IRQ/EXTI wake route.
 *
 * LPTIM1 is deliberately used in continuous mode.  The first autoreload
 * match wakes the core; the Stop return path immediately disables the timer.
 * This follows the same register sequencing as ST's HAL LPTIM counter start
 * path without enabling the unused HAL LPTIM module in this CubeIDE project.
 */
static bool CameraThread_ArmLptimWakeup(uint32_t duration_ms) {
	uint32_t seconds = (duration_ms + 999U) / 1000U;
	uint32_t period_ticks;

	if (seconds == 0U) {
		seconds = 1U;
	}
	period_ticks = seconds * CAMERA_STOP_LPTIM_TICK_HZ;
	if ((period_ticks == 0U) || (period_ticks > 65536U)) {
		return false;
	}

	/* LSE is in the backup domain.  The application uses an external DS3231 for
	 * wall-clock timestamps, so no earlier initialization path necessarily opened
	 * this domain for the MCU's own oscillator. */
	HAL_PWR_EnableBkUpAccess();
	/* Use the HAL-configured wall-clock timeout rather than a CPU-speed-dependent
	 * iteration count: LSE startup time varies with temperature and supply state. */
	__HAL_RCC_LSE_CONFIG(RCC_LSE_ON);
	const uint32_t lse_start_tick = HAL_GetTick();
	while (LL_RCC_LSE_IsReady() == 0U) {
		if ((HAL_GetTick() - lse_start_tick) > RCC_LSE_TIMEOUT_VALUE) {
			break;
		}
	}
	if (LL_RCC_LSE_IsReady() == 0U) {
		DebugConsole_Printf(
				"[STOP][LPTIM] LSE did not start after %lu ms; timer wake unavailable.\r\n",
				(unsigned long) (HAL_GetTick() - lse_start_tick));
		DebugConsole_Printf(
				"[STOP][LPTIM] RCC/PWR: DBPCR=0x%08lX CSR=0x%08lX SR=0x%08lX LSECFGR=0x%08lX.\r\n",
				(unsigned long) PWR->DBPCR, (unsigned long) RCC->CSR,
				(unsigned long) RCC->SR, (unsigned long) RCC->LSECFGR);
		return false;
	}

	__HAL_RCC_LPTIM1_CLK_ENABLE();
	__HAL_RCC_LPTIM1_CLK_SLEEP_ENABLE();
	LL_RCC_SetLPTIMClockSource(LL_RCC_LPTIM1_CLKSOURCE_LSE);

	/* Stop any stale counter and clear asynchronous status before programming
	 * ARR.  ARR is transferred into the running timer only after ARROK. */
	CLEAR_BIT(LPTIM1->CR, LPTIM_CR_ENABLE);
	LPTIM1->DIER = 0U;
	LPTIM1->ICR = LPTIM_ICR_ARRMCF | LPTIM_ICR_ARROKCF
			| LPTIM_ICR_DIEROKCF;
	MODIFY_REG(LPTIM1->CFGR, LPTIM_CFGR_CKSEL | LPTIM_CFGR_PRESC,
				LPTIM_CFGR_PRESC_0 | LPTIM_CFGR_PRESC_2);
	LPTIM1->CR = LPTIM_CR_ENABLE;
	LPTIM1->ICR = LPTIM_ICR_ARROKCF;
	LPTIM1->ARR = period_ticks - 1U;
	if (!CameraThread_LptimWaitForFlag(LPTIM_ISR_ARROK)) {
		CLEAR_BIT(LPTIM1->CR, LPTIM_CR_ENABLE);
		__HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE();
		__HAL_RCC_LPTIM1_CLK_DISABLE();
		DebugConsole_Printf(
				"[STOP][LPTIM] ARR update did not complete; skipping Stop proof.\r\n");
		return false;
	}
	LPTIM1->ICR = LPTIM_ICR_ARROKCF;

	/* LPTIM wakeup is an internal direct EXTI route on line 52.  Enable both
	 * interrupt and event masks so either WFI or the hardware wake fabric can
	 * release Stop on this STM32N6 security partition. */
	EXTI->IMR2 |= CAMERA_STOP_LPTIM_EXTI_LINE;
	EXTI->EMR2 |= CAMERA_STOP_LPTIM_EXTI_LINE;
	LPTIM1->ICR = LPTIM_ICR_ARRMCF | LPTIM_ICR_DIEROKCF;
	LPTIM1->DIER = LPTIM_DIER_ARRMIE;
	if (!CameraThread_LptimWaitForFlag(LPTIM_ISR_DIEROK)) {
		CLEAR_BIT(LPTIM1->CR, LPTIM_CR_ENABLE);
		EXTI->IMR2 &= ~CAMERA_STOP_LPTIM_EXTI_LINE;
		EXTI->EMR2 &= ~CAMERA_STOP_LPTIM_EXTI_LINE;
		__HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE();
		__HAL_RCC_LPTIM1_CLK_DISABLE();
		DebugConsole_Printf(
				"[STOP][LPTIM] interrupt update did not complete; skipping Stop proof.\r\n");
		return false;
	}

	camera_stop_wakeup_fired = false;
	NVIC_ClearPendingIRQ(LPTIM1_IRQn);
	NVIC_EnableIRQ(LPTIM1_IRQn);
	SET_BIT(LPTIM1->CR, LPTIM_CR_CNTSTRT);
	camera_stop_lptim_armed = true;
	DebugConsole_Printf(
				"[STOP][LPTIM] armed CFGR=0x%08lX CR=0x%08lX ARR=%lu ISR=0x%08lX EXTI2=0x%08lX\r\n",
				(unsigned long) LPTIM1->CFGR, (unsigned long) LPTIM1->CR,
				(unsigned long) LPTIM1->ARR, (unsigned long) LPTIM1->ISR,
				(unsigned long) EXTI->IMR2);
	return true;
}

/**
 * @brief Stop LPTIM1 and remove its Stop-mode wake route.
 * @sideeffects Disables the timer, interrupt, EXTI masks, and low-power clock.
 */
static void CameraThread_DisarmLptimWakeup(void) {
	if (!camera_stop_lptim_armed) {
		return;
	}

