rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_threadx.c
	NVIC_DisableIRQ(LPTIM1_IRQn);
	NVIC_ClearPendingIRQ(LPTIM1_IRQn);
	CLEAR_BIT(LPTIM1->CR, LPTIM_CR_ENABLE);
	LPTIM1->DIER = 0U;
	LPTIM1->ICR = LPTIM_ICR_ARRMCF | LPTIM_ICR_ARROKCF
			| LPTIM_ICR_DIEROKCF;
	EXTI->IMR2 &= ~CAMERA_STOP_LPTIM_EXTI_LINE;
	EXTI->EMR2 &= ~CAMERA_STOP_LPTIM_EXTI_LINE;
	__HAL_RCC_LPTIM1_CLK_SLEEP_DISABLE();
	__HAL_RCC_LPTIM1_CLK_DISABLE();
	camera_stop_lptim_armed = false;
}

/**
 * @brief Suspend idle NPU logic before entering Stop mode.
 * @retval None.
 * @sideeffects Invalidates and disables CACHEAXI, then gates the NPU and
 *              CACHEAXI clocks. The AXI SRAM banks remain powered so the
 *              existing relocatable network state is preserved for wake.
 */
static void CameraThread_SuspendNpuForStop(void) {
	if (!app_ai_npu_hw_initialized || camera_stop_npu_suspended) {
		return;
	}

	/* The camera worker reaches this point only after the final AI result and
	 * queue barriers. Cleanly discard cache state before removing its clock. */
	npu_cache_invalidate();
	npu_cache_disable();
	__DSB();
	__ISB();

	/* The NPU and cache do not need a Stop-mode clock or a run-mode clock while
	 * the CPU is asleep. Keep the low-power clock gates closed after wake too;
	 * the explicit resume helper reopens the run clocks before inference. */
	__HAL_RCC_NPU_CLK_SLEEP_DISABLE();
	__HAL_RCC_CACHEAXI_CLK_SLEEP_DISABLE();
	__HAL_RCC_NPU_CLK_DISABLE();
	__HAL_RCC_CACHEAXI_CLK_DISABLE();
	camera_stop_npu_suspended = true;
	DebugConsole_Printf("[STOP][NPU] NPU and CACHEAXI suspended; AXI SRAM retained.\r\n");
}

/**
 * @brief Restore NPU logic after Stop-mode clock recovery.
 * @retval None.
 * @sideeffects Re-enables the NPU and CACHEAXI clocks and the existing NPU
 *              cache without rebuilding the model network descriptors.
 */
static void CameraThread_ResumeNpuAfterStop(void) {
	if (!camera_stop_npu_suspended) {
		return;
	}

	__HAL_RCC_NPU_CLK_ENABLE();
	__HAL_RCC_CACHEAXI_CLK_ENABLE();
	npu_cache_enable();
	__DSB();
	__ISB();
	camera_stop_npu_suspended = false;
	DebugConsole_Printf("[STOP][NPU] NPU and CACHEAXI resumed.\r\n");
}

/**
 * @brief Put the xSPI2 NOR model-flash device into deep power-down.
 * @retval None.
 * @sideeffects Leaves memory-mapped mode, sends the vendor deep-power-down
 *              command, and gates the xSPI2 peripheral clock. If the command
 *              fails, the existing mapped mode is restored before Stop.
 */
static void CameraThread_SuspendXspi2ForStop(void) {
	if (!app_ai_xspi2_initialized || !app_ai_xspi2_mm_enabled
			|| camera_stop_xspi2_suspended) {
		return;
	}

	/* The NOR command interface cannot be used while the controller is in
	 * memory-mapped mode, so abort the mapped transaction first. */
	if (BSP_XSPI_NOR_DisableMemoryMappedMode(0U) != BSP_ERROR_NONE) {
		DebugConsole_Printf(
				"[STOP][XSPI2] Could not leave memory-mapped mode; retaining flash.\r\n");
		return;
	}
	app_ai_xspi2_mm_enabled = false;

	if (BSP_XSPI_NOR_EnterDeepPowerDown(0U) != BSP_ERROR_NONE) {
		DebugConsole_Printf(
				"[STOP][XSPI2] Deep-power-down command failed; retaining flash.\r\n");
		/* Restore the mapped window so a failed low-power attempt does not alter
		 * the normal post-capture runtime contract. */
		if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) == BSP_ERROR_NONE) {
			app_ai_xspi2_mm_enabled = true;
		}
		return;
	}

	__HAL_RCC_XSPI2_CLK_SLEEP_DISABLE();
	__HAL_RCC_XSPI2_CLK_DISABLE();
	camera_stop_xspi2_suspended = true;
	DebugConsole_Printf("[STOP][XSPI2] NOR entered deep power-down.\r\n");
}

/**
 * @brief Wake the xSPI2 NOR and restore its memory-mapped model window.
 * @retval None.
 * @sideeffects Enables xSPI2, exits NOR deep power-down, and restores the
 *              mapped window needed by the generated AI networks.
 */
static void CameraThread_ResumeXspi2AfterStop(void) {
	if (!camera_stop_xspi2_suspended) {
		return;
	}

	__HAL_RCC_XSPI2_CLK_ENABLE();
	if (BSP_XSPI_NOR_LeaveDeepPowerDown(0U) != BSP_ERROR_NONE) {
		DebugConsole_Printf(
				"[STOP][XSPI2] Could not leave deep power-down; AI remap may recover later.\r\n");
		camera_stop_xspi2_suspended = false;
		return;
	}

	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE) {
		DebugConsole_Printf(
				"[STOP][XSPI2] Could not restore memory-mapped mode.\r\n");
		camera_stop_xspi2_suspended = false;
		return;
	}

	app_ai_xspi2_mm_enabled = true;
	camera_stop_xspi2_suspended = false;
	DebugConsole_Printf("[STOP][XSPI2] NOR resumed and memory-mapped.\r\n");
}

/**
 * @brief Enter the guarded Stage 2 STM32N6 Stop-mode proof interval.
 * @retval true when the MCU returned from the LPTIM1 wakeup path.
 * @sideeffects Drains asynchronous log queues, flushes the SD card, pauses
 *              the HAL tick, enters Stop mode, restores clocks, and resumes
 *              the tick before returning to the capture scheduler.
 */
static bool CameraThread_EnterStopModeProof(void) {
	if (!AppInferenceRuntime_WaitForLogQueueDrain(
			CAMERA_STOP_MODE_PROOF_TIMEOUT_MS)
			|| !SdDebugLogService_WaitForQueueDrain(
					CAMERA_STOP_MODE_PROOF_TIMEOUT_MS)) {
		DebugConsole_Printf(
				"[STOP] Log queues did not drain; skipping Stop proof.\r\n");
		return false;
	}
	DebugConsole_Printf(
			"[STOP] AI result and inference/metrics log queues drained.\r\n");

	/* Capture writes are marked flush-pending, while debug metrics use a
	 * separate queue.  Complete both barriers before powering down the SD path. */
	if ((AppFileX_ServiceCaptureMediaFlush() != TX_SUCCESS)
			|| (AppFileX_ForceMediaFlush() != FX_SUCCESS)) {
		DebugConsole_Printf(
				"[STOP] Final FileX flush failed; skipping Stop proof.\r\n");
		return false;
	}

	/* Close the INA219 interval only after AI, capture, and the first media
	 * barrier have completed.  The report therefore covers the whole awake
	 * portion of this cycle, including final storage housekeeping, without
	 * counting the following Stop interval. */
	if (!INA219_CloseAwakeWindow()) {
		DebugConsole_Printf(
				"[STOP] Awake power average could not be queued; skipping Stop proof.\r\n");
		return false;
	}
	/* Closing the power window queued one more metrics record.  Drain and flush
	 * that record before arming the wake timer so the UART/SD report is complete
	 * when the MCU enters Stop mode. */
	if (!SdDebugLogService_WaitForQueueDrain(
			CAMERA_STOP_MODE_PROOF_TIMEOUT_MS)) {
		DebugConsole_Printf(
				"[STOP] Awake power log queue did not drain; skipping Stop proof.\r\n");
		return false;
	}
	if (AppFileX_ForceMediaFlush() != FX_SUCCESS) {
		DebugConsole_Printf(
			"[STOP] Awake power log flush failed; skipping Stop proof.\r\n");
		return false;
	}
	SdDebugLogService_ForceFlush();
	DebugConsole_Printf(
			"[STOP] Capture, metrics, inference, and awake-power logs flushed; entering low power.\r\n");

	/* LPTIM1 is the sole Stop wake source.  Keeping one timer and one EXTI route
	 * makes wake attribution deterministic and avoids competing asynchronous
	 * flags after the clock tree is restored. */
	if (!CameraThread_ArmLptimWakeup(CAMERA_STOP_MODE_PROOF_DURATION_MS)) {
		DebugConsole_Printf(
				"[STOP][LPTIM] Could not arm the one-minute wakeup; skipping Stop mode.\r\n");
		return false;
	}

