rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_threadx.c
	DebugConsole_Printf(
			"[STOP] Stage 2 entering Stop mode for %lu ms.\r\n",
			(unsigned long) CAMERA_STOP_MODE_PROOF_DURATION_MS);

	/* TIM5 supplies the HAL tick, while SysTick supplies the ThreadX scheduler
	 * tick in this project.  Both periodic sources must be paused so the LPTIM1
	 * wakeup is not immediately defeated by a pending scheduler tick. */
	HAL_SuspendTick();
	TIM5->SR &= ~TIM_SR_UIF;
	const uint32_t systick_ctrl = SysTick->CTRL;
	CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_TICKINT_Msk);
	SysTick->VAL = 0U;
	SCB->ICSR = SCB_ICSR_PENDSVCLR_Msk | SCB_ICSR_PENDSTCLR_Msk;
	HAL_PWREx_ControlStopModeVoltageScaling(PWR_REGULATOR_STOP_VOLTAGE_SCALE3);
	/* No task emits UART output during Stop, and the log barriers above have
	 * completed.  Gate only the LPUART peripheral clock, preserving its handle
	 * and GPIO configuration so wake does not require a risky full reinit. */
	__HAL_RCC_LPUART1_CLK_SLEEP_DISABLE();
	__HAL_RCC_LPUART1_CLK_DISABLE();
	/* A heartbeat can leave the green LED on when the Stop boundary is reached;
	 * force every user LED off so the board-level load is not held by an LED. */
	BSP_LED_Off(LED_RED);
	BSP_LED_Off(LED_BLUE);
	BSP_LED_Off(LED_GREEN);
	CameraThread_SuspendNpuForStop();
	CameraThread_SuspendXspi2ForStop();
	/* LPTIM1 is configured as a direct EXTI interrupt.  WFI is the unambiguous
	 * entry here: it keeps the CPU asleep until the timer wake interrupt reaches
	 * the NVIC, avoiding WFE event-state ambiguity. */
	HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFI);
	/* Preserve the LPTIM1 flag as a hardware-evidence fallback in case the
	 * interrupt handler was not reached before the core resumed. */
	if ((LPTIM1->ISR & LPTIM_ISR_ARRM) != 0U) {
		camera_stop_wakeup_fired = true;
	}

	/* Stop wake selects HSI.  Resume the HAL tick before restoring the PLL trees:
	 * the HAL clock and voltage-scaling routines use HAL_GetTick() for bounded
	 * waits, and leaving TIM5 suspended here can turn a recovery timeout into an
	 * apparent post-wake freeze.  SysTick remains disabled until after the clock
	 * tree is stable, so ThreadX cannot schedule during this short transition. */
	CLEAR_BIT(SCB->SCR, SCB_SCR_SLEEPDEEP_Msk);
	HAL_ResumeTick();
	App_SystemClock_Config();
	App_CameraKernelClock_Config();
	SysTick->VAL = 0U;
	SysTick->CTRL = systick_ctrl;
	CameraThread_DisarmLptimWakeup();
	/* Restore the peripheral clock before the first post-wake diagnostic line.
	 * The UART handle stayed initialized while its APB clock was gated. */
	__HAL_RCC_LPUART1_CLK_ENABLE();
	__HAL_RCC_LPUART1_CLK_SLEEP_DISABLE();
	CameraThread_ResumeXspi2AfterStop();
	CameraThread_ResumeNpuAfterStop();
	DebugConsole_Printf("[STOP] Wake returned; clocks restored.\r\n");

	if (!camera_stop_wakeup_fired) {
		DebugConsole_Printf(
				"[STOP] Returned early from Stop without the LPTIM wake flag.\r\n");
		return false;
	}
	/* Do not let the stopped interval contaminate the next awake-window
	 * duration.  The INA219 sampler resumes with the other ThreadX workers, so
	 * establish its new boundary before restarting the camera stack. */
	INA219_BeginAwakeWindow();
	DebugConsole_Printf("[STOP] Stage 2 wake complete; clocks restored.\r\n");
	return true;
}

/**
 * @brief Release the shared camera middleware lock.
 */
void App_ThreadX_UnlockCameraMiddleware(void) {
	if (!camera_capture_cmw_mutex_created) {
		return;
	}

	(void) tx_mutex_put(&camera_capture_cmw_mutex);
}

/**
 * @brief Kernel initialization hook used by CubeMX.
 */
void MX_ThreadX_Init(void) {
	/* USER CODE BEGIN Before_Kernel_Start */

	/* USER CODE END Before_Kernel_Start */

	tx_kernel_enter();

	/* USER CODE BEGIN Kernel_Start_Error */

	/* USER CODE END Kernel_Start_Error */
}

/**
 * @brief ThreadX entry point used to run camera bring-up diagnostics.
 * @param thread_input Unused ThreadX input value.
 */
static VOID CameraInitThread_Entry(ULONG thread_input) {
	(void) thread_input;

	(void) DebugConsole_WriteString("[CAMERA] thread entry\r\n");
	(void) DebugConsole_WriteString(
			"[CAMERA][THREAD] Camera init startup delay skipped; probing immediately.\r\n");
	(void) DebugConsole_WriteString("[CAMERA] probe start\r\n");
	camera_capture_isp_loop_paused = true;

	if (!App_ThreadX_LockCameraMiddleware(
			CameraPlatform_MillisecondsToTicks(
					CAMERA_MIDDLEWARE_LOCK_TIMEOUT_MS))) {
		camera_capture_isp_loop_paused = false;
		DebugConsole_Printf(
				"[CAMERA][THREAD] Failed to lock camera middleware for probe.\r\n");
		return;
	}

		if (CameraPlatform_ProbeBCamsImx() == TX_SUCCESS) {
			if (!CameraPlatform_DisableImx335AutoExposure()) {
				DebugConsole_Printf(
						"[CAMERA][THREAD] Warning: failed to lock IMX335 exposure after probe.\r\n");
			}
			App_ThreadX_UnlockCameraMiddleware();
			camera_capture_isp_loop_paused = false;
			DebugConsole_Printf(
					"[CAMERA][THREAD] Camera probe completed successfully.\r\n");

			/* FileX mounts asynchronously. Complete that one-time startup work
			 * before model initialization so the boot dry-run cannot overlap SD
			 * ACMD41 polling and consume its inference time budget. */
			if (!AppFileX_IsMediaReady()) {
				DebugConsole_Printf(
						"[CAMERA][THREAD] Waiting for FileX media before AI startup.\r\n");
				if (!AppStorage_WaitForMediaReady(
						CAMERA_STARTUP_MEDIA_READY_TIMEOUT_MS)) {
					DebugConsole_Printf(
							"[CAMERA][THREAD] FileX startup wait timed out; continuing without SD.\r\n");
				}
			}

			/* Start cleanup only after the camera has proven it can probe and
			 * capture, so the background sweeper cannot interfere with startup. */
			{
				const UINT image_cleanup_start_status = AppImageCleanup_Start();
				if (image_cleanup_start_status != TX_SUCCESS) {
					DebugConsole_Printf(
							"[IMAGE][CLEANUP] Deferred start failed, status=%lu.\r\n",
							(unsigned long) image_cleanup_start_status);
				}
			}

	if (!App_AI_Model_Init()) {
				DebugConsole_Printf(
					"[AI] Model runtime init failed; continuing without inference.\r\n");
		}

#if APP_AI_ENABLE_TIP_FOCUS_GEOMETRY_STAGE && APP_AI_ENABLE_TIP_FOCUS_BOOT_DRY_RUN
		(void)AppAI_TipFocus_DryRun();
#endif

