rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_threadx.c
		BSP_LED_Off(LED_BLUE);
		DebugConsole_Printf(
				"[CAMERA][THREAD] Entering capture/Stop loop (sleep=60s)...\r\n");
		while (1) {
			bool storage_ready = AppFileX_IsMediaReady();
			uint32_t next_delay_ms = CAMERA_CAPTURE_PERIOD_MS;

			/* Do not consume the first frame while FileX is still mounting the
			 * card. The previous flow captured immediately, skipped the SD write,
			 * and then allowed AI and SD bring-up to contend for the same window. */
			if (!storage_ready) {
				DebugConsole_Printf(
						"[CAMERA][THREAD] Waiting for FileX media before capture.\r\n");
				if (!AppStorage_WaitForMediaReady(
						CAMERA_STARTUP_MEDIA_READY_TIMEOUT_MS)) {
					DebugConsole_Printf(
							"[CAMERA][THREAD] FileX media wait timed out; retrying capture later.\r\n");
					DelayMilliseconds_Cooperative(5000U);
					continue;
				}
				storage_ready = true;
				DebugConsole_Printf(
						"[CAMERA][THREAD] FileX media ready; starting capture.\r\n");
			}

			/* Run the requested burst serially. Each call waits for the previous
			 * AI handoff to release the shared stopped-sensor buffer, so this does
			 * not require a second 400 KiB DMA buffer. */
#if APP_AI_ENABLE_INFERENCE_BURST_SMOOTHING
			AppAI_ResetInferenceBurstHistory();
#endif
			AppInferenceRuntime_BeginBurst();
			DebugConsole_Printf(
					"[CAMERA][THREAD] Starting %lu-frame capture/AI burst.\r\n",
					(unsigned long)CAMERA_CAPTURE_BURST_COUNT);
			for (uint32_t burst_index = 0U;
					burst_index < CAMERA_CAPTURE_BURST_COUNT; ++burst_index) {
				AppInferenceRuntime_SetNextRequestFinal(
						(burst_index + 1U) == CAMERA_CAPTURE_BURST_COUNT);
				if (AppCameraCapture_CaptureAndStoreSingleFrame()) {
					DebugConsole_Printf(
							"[CAMERA][THREAD] Burst frame %lu/%lu saved and handed to AI.\r\n",
							(unsigned long)(burst_index + 1U),
							(unsigned long)CAMERA_CAPTURE_BURST_COUNT);
				} else {
					DebugConsole_Printf(
							"[CAMERA][THREAD] Burst frame %lu/%lu capture/inference failed.\r\n",
							(unsigned long)(burst_index + 1U),
							(unsigned long)CAMERA_CAPTURE_BURST_COUNT);
				}
			}

			/* RequestDryInference() is asynchronous in the live no-copy path.
			 * Wait for final publication and ownership release before touching
			 * CMW/DCMIPP or powering down the camera. */
			if (!AppCameraCapture_WaitForInferenceOwnershipRelease()) {
				DebugConsole_Printf(
						"[CAMERA][POWER] AI ownership did not clear; deferring Stage 1 restart.\r\n");
				DelayMilliseconds_ThreadX(next_delay_ms);
				continue;
			}
			/* The ownership barrier means the AI worker has completed its read of
			 * the final burst frame and Metrics_EndInference(). A failed final
			 * result still emits failure metrics; make that state visible without
			 * allowing it to bypass the pre-sleep flush barrier. */
			if (!AppInferenceRuntime_WasLastRequestSuccessful()) {
				DebugConsole_Printf(
						"[CAMERA][POWER] AI burst completed without a valid final result; flushing failure metrics before sleep.\r\n");
			}

			/* Stop the camera before the low-power transition.  The module must stay
			 * off while Stop mode is active; restarting it before sleep would leave
			 * DCMIPP/CMW state live across the clock reset and make wake recovery
			 * dependent on undefined peripheral state. */
			const bool camera_stop_ok = CameraThread_StopCameraStack();
			if (!camera_stop_ok) {
				DebugConsole_Printf(
						"[CAMERA][POWER] Camera stop failed; skipping low-power transition.\r\n");
			}

			bool camera_start_ok = false;
#if CAMERA_STOP_MODE_PROOF_ENABLE
			/* Stage 2 is attempted only after the camera is fully stopped. If any
			 * queue, flush, LPTIM, or wake condition is not ready, restart the camera
			 * and use the retry delay below. */
			bool stop_interval_completed = false;
			if (camera_stop_ok) {
				stop_interval_completed = CameraThread_EnterStopModeProof();
				camera_start_ok = CameraThread_StartCameraStack();
			}
#else
			/* With the Stop proof disabled, retain the already validated Stage 1
			 * behavior: power-cycle the camera and probe it again immediately. */
			if (camera_stop_ok) {
				camera_start_ok = CameraThread_StartCameraStack();
			}
#endif
			if (!camera_start_ok) {
				DebugConsole_Printf(
						"[CAMERA][POWER] Camera restart after low-power transition failed.\r\n");
			}

#if CAMERA_STOP_MODE_PROOF_ENABLE
			/* A successful one-minute Stop interval is the cadence now: after wake
			 * and camera restart, the next burst begins immediately.  Retain the
			 * old retry delay whenever the low-power cycle or restart fails. */
			if (!stop_interval_completed || !camera_start_ok) {
				DelayMilliseconds_ThreadX(next_delay_ms);
			}
#else
			/* Without Stage 2, preserve the validated one-minute ThreadX cadence. */
			DelayMilliseconds_ThreadX(next_delay_ms);
#endif
		}
	}

	App_ThreadX_UnlockCameraMiddleware();
	camera_capture_isp_loop_paused = false;
	DebugConsole_Printf(
			"[CAMERA][THREAD] Camera probe failed or is not configured yet.\r\n");
}

/**
 * @brief Low-priority heartbeat thread that toggles a visible board LED.
 * @param thread_input Unused ThreadX input value.
 */
static VOID CameraHeartbeatThread_Entry(ULONG thread_input) {
	(void) thread_input;

	/* Drive the user-visible green LED so the board shows liveness without
	 * relying on UART traffic or a hidden GPIO. */
	BSP_LED_Off(LED_GREEN);
	DebugConsole_Printf("[WATCHDOG] heartbeat thread running.\r\n");

	while (1) {
		BSP_LED_Toggle(LED_GREEN);
		/* The LED remains the liveness indicator. UART pulses are opt-in because
		 * a five-second heartbeat obscures capture and inference failures. */
#if CAMERA_HEARTBEAT_ENABLE_UART_PULSES
		/* Read the external RTC only for this low-rate diagnostic line.  Keeping
		 * the capture and inference logs free of per-line I2C reads avoids adding
		 * blocking RTC retries to the hot path. */
		char watchdog_timestamp[32] = { 0 };
		if (App_Clock_GetCurrentTimestamp(watchdog_timestamp,
				sizeof(watchdog_timestamp))) {
			DebugConsole_Printf("[%s] [WATCHDOG] pulse\r\n",
					watchdog_timestamp);
		} else {
			/* Preserve the heartbeat even if the DS3231 is temporarily offline. */
			DebugConsole_WriteString("[WATCHDOG] pulse (RTC unavailable)\r\n");
		}
#endif
		DelayMilliseconds_ThreadX(CAMERA_HEARTBEAT_PULSE_MS);
		BSP_LED_Toggle(LED_GREEN);
		DelayMilliseconds_ThreadX(CAMERA_HEARTBEAT_PERIOD_MS
				- CAMERA_HEARTBEAT_PULSE_MS);
	}
}

/**
 * @brief Low-priority camera ISP thread that keeps the middleware running.
 * @param thread_input Unused ThreadX input value.
 */
static VOID CameraIspThread_Entry(ULONG thread_input) {
	(void) thread_input;

